multirun_template/common/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../paramsDict"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);
// internalField           uniform (0 $U_z 0);

boundaryField
{
    "patch.*"
    {
        type            cyclicAMI;
        // value           uniform (0 0 0);
    }

    sphere
    {
        type zeroShear;
        slipLength      uniform $NavierSlipLenght;
        write           true;
    }
}


// ************************************************************************* //
