multirun_template/common/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../paramsDict"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    "patch.*"
    {
        type            cyclicAMI;
        // value           uniform 0;
    }

    sphere
    {
        type               zeroShear;
        slipLength         uniform $NavierSlipLenght;
        write              true;
    }
}


// ************************************************************************* //
