multirun_template/common/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../paramsDict"

solvers
{
    // pimple
    // "p.*"
    // {
    //     solver          PCG;
    //     preconditioner  DIC;
    //     tolerance       1e-06;
    //     relTol          0;
    // }

    //simple
    p
    {
        solver          GAMG;
        // smoother        GaussSeidel;
        smoother        DICGaussSeidel; //Nico
        tolerance       $ptol;
        relTol          $relativeTol;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       $Utol;
        relTol          $relativeTol;
    }
    // UFinal
    // {
    //     $U;
    //     relTol          0.01;
    // }
    // pFinal
    // {
    //     $p;
    //     relTol          0.01;
    // }
}

// PISO
// {
//     nCorrectors     2;
//     nNonOrthogonalCorrectors 0;
// }


SIMPLE
{
    nNonOrthogonalCorrectors $NonOrthogonalCorrectors;
    consistent      true;
    // Nico

    residualControl
    {
        p               $pres;
        U               $Ures;
    }
    pRefCell           0;
    // pRefPoint (0.001 0.001 0.001); // maybe better ?
    pRefValue          0;
}

PIMPLE
{
    nNonOrthogonalCorrectors 0;
    nCorrectors         2;
    pRefCell           0;
    pRefValue           0;
}


relaxationFactors
{
    // equations
    // {
    //     U               0.9; // 0.9 is more stable but 0.95 more convergent
    //     ".*"            0.9; // 0.9 is more stable but 0.95 more convergent
    // }

    fields
    {
        p               0.3;
    }
    equations
    {
        U               0.7;
        ".*"            0.7;
    }
}

// ************************************************************************* //
